{
    "common":  {
                   "name":  "Name",
                   "tiny":  "Tiny",
                   "errorVideo":  "Your browser does not support videos.",
                   "context":  "Context",
                   "objectives":  "Objectives",
                   "icon":  "Icon",
                   "back":  "Back",
                   "search":  "Search",
                   "files":  "Files",
                   "folder":  "Folder",
                   "next":  "Next",
                   "projects":  "Projects",
                   "go":  "Go",
                   "address":  "Address",
                   "design":  "Pictures",
                   "tasksDone":  "Tasks done on the project",
                   "techInfo":  "Technical informations",
                   "componentsDot":  "Components :",
                   "components":  "Components",
                   "models":  "Models",
                   "model":  "Model",
                   "links":  "Links",
                   "link":  "Link",
                   "hddDots":  "HDD :",
                   "disks":  "Disks",
                   "quantity":  "Quantity",
                   "viewModel":  "Go to model",
                   "CDM":  "CDM",
                   "PDM":  "PDM",
                   "years":  "years old",
                   "gamedev":  "Game Developer",
                   "webdev":  "Web Developer",
                   "softwaredev":  "Software Developer",
                   "textDocument":  "Text Document",
                   "list":  "List",
                   "modifications":  "Modifications",
                   "loading":  "Loading...",
                   "language":  "Language",
                   "hebrew":  "Hebrew",
                   "english":  "English"
               },
    "message":  {
                    "welcome":  "Welcome to my computer",
                    "toBegin":  "To begin the journey, click on my username.",
                    "explainer":  "After logging in, you can browse through the folders on my computer. Go to the desktop and click on the projects folder to see all my projects."
                },
    "header":  {
                   "disconnect":  "Log Off",
                   "shutdown":  "Turn Off Computer"
               },
    "modale":  {
                   "fullscreenTitle":  "Fullscreen mode is now available!",
                   "fullscreenFirstText":  "For a more immersive experience,",
                   "fullscreenSecondText":  "Click on the screen icon below",
                   "control":  "Control"
               },
    "buttons":  {
                    "start":  "start",
                    "send":  "Send",
                    "downloadCV":  "Download the CV",
                    "linkWebSite":  "Visit the website",
                    "linkRepository":  "Visit the repository"
                },
    "windows":  {
                    "contact":  {
                                    "name":  "@:common.name",
                                    "description":  "If you\u0027d like to talk about a project, or just have a chat, leave me a message and I\u0027ll get back to you as soon as possible!",
                                    "email":  "Email",
                                    "msgPlaceholder":  "Message here...",
                                    "success":  "Message sent successfully",
                                    "error":  {
                                                  "email":  " is not a valid e-mail address",
                                                  "empty":  "Please fill in all fields before sending your message",
                                                  "unknown":  "The message could not be sent. You can contact me directly at the following email address: ",
                                                  "cooldown":  "Please wait {time} before sending another message."
                                              },
                                    "send":  "Send",
                                    "cut":  "Cut",
                                    "copy":  "Copy",
                                    "paste":  "Paste",
                                    "undo":  "Undo",
                                    "check":  "Check",
                                    "spelling":  "Spelling",
                                    "attach":  "Attach",
                                    "priority":  "Priority",
                                    "sign":  "Sign",
                                    "to":  "To :",
                                    "from":  "From :",
                                    "subject":  "Subject :",
                                    "characters":  "characters",
                                    "cooldownWait":  "Please wait",
                                    "beforeSending":  "before sending another message"
                                },
                    "cv":  {
                               "altPicture":  "presentation CV",
                               "education":  "Education",
                               "proExperience":  "Professional experiences",
                               "projects":  "Projects",
                               "technicalSkills":  "Technical Skills",
                               "languages":  "Languages",
                               "frameworks":  "Frameworks \u0026 Tools"
                           },
                    "music":  {
                                  "playlistName":  "Portfolio Playlist",
                                  "title":  "Title",
                                  "album":  "Album",
                                  "dateAdded":  "Date Added",
                                  "duration":  "Duration",
                                  "link":  "Link",
                                  "artist":  "Artist",
                                  "description":  "A playlist created especially for my portfolio, it contains some of my favorite tracks :)",
                                  "visitOnSpotify":  "Listen on Spotify",
                                  "accessFirstSentence":  "To access this feature,",
                                  "accessSecondSentence":  "it is mandatory to connect to Spotify",
                                  "connectToSpotify":  "Connect to Spotify",
                                  "spotifyDisclaimer":  "This playlist and its use has been made using the Spotify API",
                                  "albumCover":  "Album cover",
                                  "playlistCoverAlt":  "Playlist cover"
                              },
                    "pictures":  {
                                     "previous":  "Previous picture",
                                     "next":  "Next picture",
                                     "rotateLeft":  "Rotate left",
                                     "rotateRight":  "Rotate right"
                                 },
                    "documents":  {
                                      "about":  {
                                                    "title":  "About",
                                                    "contextFirstParagraph":  "This project was born out of a desire to create a portfolio that would be both fun and original.",
                                                    "contextSecondParagraph":  "The idea was to create the Windows XP computer interface, which would allow visitors to browse the folders and files in my computer\u0027s session.",
                                                    "contextThirdParagraph":  "I wanted to present my projects from a different angle, where users could wander around. Something more than just a business card on the web. Something interactive.",
                                                    "contextFourthParagraph":  "The project was designed to be as close as possible to a real Windows XP computer interface, with a desktop, folders, and files.",
                                                    "contextFifthParagraph":  "Windows XP is the first operating system I used, and it\u0027s design is a madeleine de proust for me. I wanted to pay tribute to it.",
                                                    "contextSixthParagraph":  "This project was created with Vue.js, Pinia, Vue Router, Tailwind CSS, and SCSS. It was adapted and enhanced with additional features and projects. Visit it at https://yonisabag11.github.io/portfolio",
                                                    "contextSeventhParagraph":  "This project has been made with a lot of passion and patience, and I hope you enjoy browsing through my computer!",
                                                    "secondTitle":  "Thanks",
                                                    "helpFirst":  "This project was carried out with the help of Dockurr windows xp, which enabled me to run a Windows XP environment on my computer very easily.",
                                                    "helpSecond":  "Spotify\u0027s API enabled me to retrieve my playlist information, display it on my site and add an integrated player.",
                                                    "helpThird":  "The website is built with Vite and deployed on GitHub Pages with automated CI/CD using GitHub Actions. Contact form functionality is powered by EmailJS.",
                                                    "helpFourth":  "I was able to recover the Windows XP images and integrate them into my project thanks to the internet archive website. Many thanks to them.",
                                                    "helpFifth":  "Special thanks to the original creator of this Windows XP portfolio concept, whose work inspired this adaptation."
                                                },
                                      "legal":  {
                                                    "title":  "Legal notices",
                                                    "firstParagraph":  "In accordance with legal requirements, users of Yoni Sabag's portfolio site are informed of the identity of the various parties involved in its creation and management.",
                                                    "edit":  "Site editing",
                                                    "secondParagraph":  "This site is edited by:",
                                                    "thirdParagraph":  "Yoni Sabag",
                                                    "hosting":  "Hosting",
                                                    "fourthParagraph":  "The site is hosted by GitHub Pages.",
                                                    "dirPublication":  "Publication director",
                                                    "fifthParagraph":  "The publication director is: Yoni Sabag.",
                                                    "contact":  "Contact",
                                                    "sixthParagraph":  "For any questions, information about the products presented on the Site, or regarding the Site itself, you can leave a message at the following email address:"
                                                }
                                  }
                },
    "project":  {
                    "footballClips":  {
                                          "funMessage":  "Enjoy my second hobby! ⚽🏃‍♂️"
                                      },
                    "discreteMath":  {
                                         "contextFirstParagraph":  "Discrete Math Escape Room is an educational 2D top-down puzzle game built in Godot 4.5 that teaches discrete mathematics concepts through interactive mini-games. Players navigate through interconnected rooms solving cryptography, logic, and set theory puzzles.",
                                         "contextSecondParagraph":  "The game features a health system where incorrect puzzle attempts cost hearts, creating meaningful consequences for learning. Players explore a pixel-art environment, interacting with objects to find clues and unlock three distinct mathematical puzzles that must all be completed to escape.",
                                         "contextThirdParagraph":  "Developed as a capstone project from September 2025 to December 2025, this game demonstrates advanced Godot Engine skills including singleton autoloads, scene management, and persistent state systems while creating an engaging educational experience.",
                                         "goalFirst":  "Teach discrete mathematics through interactive gameplay mechanics",
                                         "goalSecond":  "Implement three mathematically accurate mini-games: Affine Cipher decryption, Truth Table completion, and Set Theory intersections",
                                         "goalThird":  "Create a health penalty system that encourages learning from mistakes",
                                         "goalFourth":  "Design an intuitive interaction system with visual feedback",
                                         "goalFifth":  "Build a complete game loop with progression tracking and win conditions",
                                         "goalSixth":  "Develop a polished retro-styled UI with menus, dialogs, and HUD",
                                         "tasksDoneFirst":  "Modular mini-game architecture",
                                         "tasksDoneFirstDetails":  "Engineered a BaseMiniGame class with three educational puzzles: an Affine Cipher decoder implementing D(x) = a⁻¹(x - b) mod 26 with 15 unique encrypted messages, a Truth Table puzzle covering logical operators (NOT, AND, OR, implication, equivalence) with 5 question variations, and a Set Theory grid game requiring players to find intersection elements using coordinate systems. Each mini-game includes persistent state, limited attempts (3 per puzzle), success/failure callbacks, and automatic player freezing during gameplay.",
                                         "tasksDoneSecond":  "Singleton-based game systems",
                                         "tasksDoneSecondDetails":  "Built five autoload singletons to manage game state: MiniGameManager for puzzle lifecycle and completion tracking, DialogBox for dynamic text display with BBCode support and auto-sizing, HealthManager for heart-based HP system, InteractionManager for proximity-based object interactions with sorted distance calculations, and NavigationManager for room transitions with spawn positioning. All systems communicate via signals for loose coupling.",
                                         "tasksDoneThird":  "Complete UI/UX implementation",
                                         "tasksDoneThirdDetails":  "Designed and implemented a comprehensive interface using the Press Start 2P pixel font throughout: main menu with play/quit options, pause menu accessible via ESC with resume/quit functionality, dynamic player HUD displaying hearts that update in real-time, dialog boxes that auto-size based on text content, mini-game UIs with feedback labels and attempt counters, and a win screen that tracks all puzzle completion and allows restart or main menu navigation.",
                                         "tasksDoneFourth":  "Room-based progression system",
                                         "tasksDoneFourthDetails":  "Created multiple interconnected rooms using a door-based navigation system. Each room contains InteractableObjects that trigger either text dialogs or mini-games. Implemented a final door that checks completion status of all three puzzles (Cipher, Truth Tables, Set Theory) and displays color-coded progress (green=complete, red=in progress, gray=not started) before allowing escape. Game only wins when all puzzles are successfully solved."
                                     },
                    "mazeEscape":  {
                                       "contextFirstParagraph":  "Maze Escape is a 2D top-down action shooter developed in Unity as a final project for Game Design and Development course from September 2024 to December 2024.",
                                       "contextSecondParagraph":  "The game challenges players to navigate through a single arena-style map while battling waves of enemies with distinct AI behaviors, collecting power-ups, and surviving against a boss enemy that spawns additional threats.",
                                       "contextThirdParagraph":  "This project demonstrates core Unity development skills including scripted enemy behavior implementation, health systems, power-up mechanics, mouse-aim shooting controls, and dash movement abilities.",
                                       "goalFirst":  "Create responsive 2D top-down controls with mouse-aim shooting",
                                       "goalSecond":  "Implement three unique enemy behavior types with distinct patterns",
                                       "goalThird":  "Design power-up collection system for health and speed boosts",
                                       "goalFourth":  "Develop UI health tracking for player and boss encounters",
                                       "goalFifth":  "Build boss enemy with multi-directional shooting and enemy spawning",
                                       "goalSixth":  "Add dash ability for tactical player movement",
                                       "tasksDoneFirst":  "Player controller and shooting mechanics",
                                       "tasksDoneFirstDetails":  "Implemented WASD movement controls with mouse-aim shooting where the player rotates to face the cursor. Created impulse-based bullet firing system that launches projectiles toward the mouse direction on click. Added dash ability using spacebar for quick evasive movement with cooldown system.",
                                       "tasksDoneSecond":  "Enemy behaviors with varied patterns",
                                       "tasksDoneSecondDetails":  "Developed three distinct enemy types: Chase enemies that pursue the player within detection radius and deal knockback damage on contact; Ranged enemies that maintain distance while firing projectiles at the player; and Burn enemies that apply damage-over-time effects through coroutines when colliding with the player.",
                                       "tasksDoneThird":  "Power-up collection system",
                                       "tasksDoneThirdDetails":  "Created collectible power-ups including health restoration items, speed boosts that permanently increase movement speed, and enemy reducer power-ups that damage all enemies on screen simultaneously. Implemented trigger-based pickup system with immediate destruction upon collection.",
                                       "tasksDoneFourth":  "Boss encounter mechanics",
                                       "tasksDoneFourthDetails":  "Built a stationary boss enemy that activates when the player enters its detection radius. Boss fires bullets from multiple fire points simultaneously in fixed directions and spawns all three enemy types around itself at intervals. Implemented dedicated boss health UI system separate from standard enemy health."
                                   },
                    "nourishNet":  {
                                       "contextFirstParagraph":  "NourishNet is a cross-platform mobile application developed with React Native and Expo that helps users locate and access food assistance resources in their area. The app provides detailed information about food pantries, soup kitchens, and community distribution centers including operating hours, eligibility requirements, and dietary accommodations.",
                                       "contextSecondParagraph":  "The application features real-time geolocation with interactive map and list views, enabling users to discover nearby food resources with distance calculations. Users can filter resources by availability (currently open), dietary needs (vegetarian, gluten-free, halal, kosher), organization type, transportation method, and personal information requirements.",
                                       "contextThirdParagraph":  "Developed as a final mobile development project from November 2025 to December 2025, this app demonstrates practical implementation of Firebase Firestore, Google Maps integration, AsyncStorage for local data persistence, and polished mobile UI/UX with custom animations and gesture handling.",
                                       "goalFirst":  "Build an accessible mobile solution for locating food assistance resources",
                                       "goalSecond":  "Implement location-based resource discovery with map and list views",
                                       "goalThird":  "Create comprehensive filtering system for personalized resource matching",
                                       "goalFourth":  "Integrate Firebase Firestore for real-time data management",
                                       "goalFifth":  "Enable offline-capable favorites using AsyncStorage",
                                       "goalSixth":  "Design smooth UI transitions and gesture-based interactions",
                                       "tasksDoneFirst":  "React Native mobile app architecture",
                                       "tasksDoneFirstDetails":  "Built a cross-platform mobile application using React Native and Expo SDK, enabling iOS and Android deployment from a single codebase. Implemented stack-based navigation with React Navigation, including modal presentations and custom slide transitions. Created reusable components and established a centralized state management pattern using a custom store implementation with subscription-based updates.",
                                       "tasksDoneSecond":  "Location services and mapping",
                                       "tasksDoneSecondDetails":  "Integrated Expo Location API with permission handling flow and fallback to default location (New York). Implemented react-native-maps with custom markers showing resource locations with animated drop-in effects. Created distance calculation functionality using the Haversine formula to compute proximity in miles. Built dual-view system allowing users to toggle between interactive map with clustered markers and sortable list view with distance indicators.",
                                       "tasksDoneThird":  "Advanced filtering and search",
                                       "tasksDoneThirdDetails":  "Developed comprehensive filtering system with modal presentation supporting multiple criteria: availability (open now based on current day/time parsing), dietary needs (multi-select), organization type (government, church, community center, non-profit), transportation method (walking/transit/driving with distance-based filtering), and personal information requirements. Implemented Firestore query optimization with client-side filtering for complex multi-criteria searches.",
                                       "tasksDoneFourth":  "Data persistence and favorites",
                                       "tasksDoneFourthDetails":  "Implemented AsyncStorage for offline-capable favorites management, persisting user preferences locally. Created swipe-to-delete gesture interaction for removing favorites using react-native-gesture-handler. Built detailed resource view with comprehensive information display including parsed operating hours, eligibility criteria, rules, transportation info, and additional details. Integrated deep linking to Apple Maps with coordinate-based or address-based navigation.",
                                       "tasksDoneFifth":  "UI/UX and animations",
                                       "tasksDoneFifthDetails":  "Designed polished user interface with custom animations including welcome screen fade-in sequences, map marker drop animations, smooth tab transitions using spring physics, and favorite button scale feedback. Implemented pull-to-refresh functionality, segmented controls for view switching, and responsive layouts optimized for different screen sizes. Created custom permission request flow with animated modal presentation for location access."
                                   },
                    "gameAssetAiAgent":  {
                                             "contextFirstParagraph":  "Game Asset AI Agent is a conversational AI web application that helps game developers generate 2D game assets through natural language chat interactions.",
                                             "contextSecondParagraph":  "The application features a Discord-like chat interface built with React, powered by a Python Flask backend that combines Google\u0027s Gemini 2.5 Flash Lite for intelligent conversation and context-aware prompt enhancement with Clipdrop\u0027s text-to-image API for actual asset generation. The AI maintains conversation history to understand user intent and project requirements across multiple interactions.",
                                             "contextThirdParagraph":  "The project demonstrates AI-powered workflow integration through a conversational interface where users can naturally describe their needs, receive AI-enhanced prompts for approval, and generate game-ready visual assets with built-in credit tracking, image preview, and download capabilities.",
                                             "goalFirst":  "Create a conversational AI assistant for game asset generation",
                                             "goalSecond":  "Build an intuitive Discord-style chat interface with React",
                                             "goalThird":  "Integrate Gemini AI for natural language understanding and intent recognition",
                                             "goalFourth":  "Implement context-aware conversation with memory across chat sessions",
                                             "goalFifth":  "Provide seamless image generation workflow with preview and download features",
                                             "goalSixth":  "Enable intelligent prompt enhancement for better asset generation quality",
                                             "tasksDoneFirst":  "React chat interface development",
                                             "tasksDoneFirstDetails":  "Built a Discord-inspired chat UI using React and Vite with real-time messaging, conversation history, and auto-scrolling. Implemented user scroll detection with a \u0027scroll to bottom\u0027 button for better UX. Created message components with markdown support, timestamps, and avatar styling for both user and AI messages.",
                                             "tasksDoneSecond":  "Conversational AI with context awareness",
                                             "tasksDoneSecondDetails":  "Integrated Google\u0027s Gemini 2.5 Flash Lite to enable natural conversations with intent recognition, distinguishing between casual chat and asset generation requests. Implemented conversation history tracking (last 10 messages) to maintain context across interactions, allowing the AI to remember previously discussed game themes, styles, and preferences without requiring users to repeat information.",
                                             "tasksDoneThird":  "Intent recognition and confirmation workflow",
                                             "tasksDoneThirdDetails":  "Developed a multi-step generation pipeline using Gemini AI to interpret user intent in different contexts (confirmation responses, new image requests, general chat). The system analyzes user responses to determine if they\u0027re affirming, declining, or need clarification, creating a natural conversational flow with randomized response variations for a more human-like experience.",
                                             "tasksDoneFourth":  "Image generation and asset management",
                                             "tasksDoneFourthDetails":  "Integrated Clipdrop API for text-to-image generation with enhanced prompts from Gemini. Implemented fullscreen image preview modal, direct download functionality, and credit tracking system that monitors remaining free API calls (100 free). Created visual credit indicators with color-coded warnings when credits run low, and included automatic notifications at key thresholds (5 and 1 remaining)."
                                         },
                    "portfolioXP":  {
                                        "contextFirstParagraph":  "PortfolioXP is an interactive portfolio website designed as a faithful recreation of the iconic Windows XP operating system interface, bringing nostalgic computing experiences to the modern web.",
                                        "contextSecondParagraph":  "Built with Vue.js 3, Vite, Tailwind CSS, and SCSS, this project demonstrates advanced frontend development skills through pixel-perfect UI replication, custom animations, state management with Pinia stores, and internationalization support for English and Hebrew languages.",
                                        "contextThirdParagraph":  "The portfolio transforms the traditional resume format into an engaging, exploratory experience where visitors can navigate through desktop icons, open windows, browse projects, play games like Maze Escape and Discrete Math Escape Room, listen to music, view a CV, send emails, and interact with a fully functional Windows XP-themed environment that showcases development projects in an innovative and memorable way.",
                                        "goalFirst":  "Recreate the Windows XP interface with pixel-perfect accuracy and authentic interactions",
                                        "goalSecond":  "Build a modular component architecture for reusable UI elements and windows",
                                        "goalThird":  "Implement state management for window positioning, open applications, and user preferences",
                                        "goalFourth":  "Create an internationalized experience supporting multiple languages (English, Hebrew)",
                                        "goalFifth":  "Integrate interactive features including music player, image gallery, calendar, and contact form",
                                        "goalSixth":  "Optimize performance and accessibility while maintaining the retro aesthetic",
                                        "tasksDoneFirst":  "Vue.js 3 architecture and component system",
                                        "tasksDoneFirstDetails":  "Developed a comprehensive component-based architecture using Vue.js 3 Composition API with over 50 custom components including windows, buttons, menus, modals, and interactive elements. Implemented Vue Router for navigation between Loader and Office views, managing the login flow and desktop experience. Created reusable layout components like Window.vue, ContentCenter.vue, and DesktopAppsLayout.vue that provide consistent structure across all application windows. Utilized Pinia stores (windowsStore, localeStore, connectionStore, volumeStore, desktopIconsStore, goBackStore) for centralized state management with localStorage persistence.",
                                        "tasksDoneSecond":  "Authentic Windows XP UI/UX implementation",
                                        "tasksDoneSecondDetails":  "Carefully recreated the Windows XP visual design system including the iconic Bliss wallpaper, Luna theme colors, gradient backgrounds, window chrome with minimize/maximize/close buttons, start menu with animated transitions, taskbar with system tray, and authentic cursors. Implemented pixel-perfect CSS gradients matching the original Windows XP UI, custom fonts (MS Sans Serif, Tahoma, Trebuchet MS), and responsive layouts that adapt the XP interface to modern screen sizes. Added subtle animations and hover effects that mirror the original OS interactions, creating an immersive nostalgic experience.",
                                        "tasksDoneThird":  "Internationalization and content management",
                                        "tasksDoneThirdDetails":  "Integrated Vue I18n for comprehensive internationalization supporting English and Hebrew (RTL) languages with over 250 translation keys across all UI elements, project descriptions, and system messages. Created a structured data management system using JSON files (projects-data.json, cv-data.json, playlist-data.json, pictures-data.json, terminal-data.json, windows-data.json, header-menu-data.json) for easy content updates without code changes. Implemented dynamic component loading based on project selection, allowing each project to have its own detailed content component with custom layouts and media.",
                                        "tasksDoneFourth":  "DevOps and deployment pipeline",
                                        "tasksDoneFourthDetails":  "Established a complete CI/CD pipeline using Jenkins for automated builds and deployments, integrated SonarQube for code quality analysis and maintaining clean code standards, and created Docker containerization with nginx web server for consistent production deployments. Configured GitHub Pages deployment workflow for hosting the portfolio website with proper base path configuration. Implemented build optimization with Vite bundler for fast load times, code splitting, and efficient asset delivery. Added comprehensive E2E testing using Nightwatch.js to ensure functionality across different browsers and maintain quality assurance throughout development iterations.",
                                        "noPicturesMessage":  "There's no pictures for this project, just go look around :)"
                                    }
                },
    "footer":  {
                   "fullscreen":  "Fullscreen mode",
                   "exitFullscreen":  "Exit fullscreen mode",
                   "volumeControl":  "Volume"
               },
    "alt":  {
                "logoStart":  "XP Portfolio black logo start",
                "logoLoading":  "XP Portfolio black logo loading",
                "logoLogin":  "XP Portfolio white logo login",
                "currLang":  "Current language",
                "cvPhoto":  "CV photo",
                "albumCover":  "Album cover",
                "previousMusic":  "Previous track",
                "nextMusic":  "Next track",
                "dropdown":  "Dropdown",
                "expand":  "Expand",
                "project":  "Project",
                "projectIcon":  "Project icon"
            }
}
