{
    "common":  {
                   "name":  "שם",
                   "tiny":  "קטן",
                   "errorVideo":  "הדפדפן שלך לא תומך בוידאו.",
                   "context":  "הקשר",
                   "objectives":  "מטרות",
                   "icon":  "אייקון",
                   "back":  "חזרה",
                   "search":  "חיפוש",
                   "files":  "קבצים",
                   "folder":  "תיקייה",
                   "next":  "הבא",
                   "projects":  "פרויקטים",
                   "go":  "ללכת",
                   "address":  "כתובת",
                   "design":  "תמונות",
                   "tasksDone":  "משימות שבוצעו בפרויקט",
                   "techInfo":  "מידע טכני",
                   "componentsDot":  "רכיבים :",
                   "components":  "רכיבים",
                   "models":  "מודלים",
                   "model":  "מודל",
                   "links":  "קישורים",
                   "link":  "קישור",
                   "hddDots":  "HDD :",
                   "disks":  "דיסקים",
                   "quantity":  "כמות",
                   "viewModel":  "לראות מודל",
                   "CDM":  "CDM",
                   "PDM":  "PDM",
                   "years":  "בן",
                   "gamedev":  "מפתח משחקים",
                   "webdev":  "מפתח אתרים",
                   "softwaredev":  "מפתח תוכנה",
                   "textDocument":  "מסמך טקסט",
                   "list":  "רשימה",
                   "modifications":  "שינויים",
                   "loading":  "טוען...",
                   "language":  "שפה",
                   "english":  "אנגלית",
                   "hebrew":  "עברית"
               },
    "message":  {
                    "welcome":  "ברוכים הבאים למחשב שלי",
                    "toBegin":  "כדי להתחיל את המסע, לחץ על שם המשתמש שלי.",
                    "explainer":  "לאחר ההתחברות, תוכל לדפדף בתיקיות במחשב שלי. עבור לשולחן העבודה ולחץ על תיקיית הפרויקטים כדי לראות את כל הפרויקטים שלי."
                },
    "header":  {
                   "disconnect":  "התנתק",
                   "shutdown":  "כבה מחשב"
               },
    "startMenu":  {
                      "allPrograms":  "כל התוכניות",
                      "myDocuments":  "המסמכים שלי",
                      "myRecentDocuments":  "מסמכים אחרונים",
                      "myPictures":  "התמונות שלי",
                      "myMusic":  "המוזיקה שלי",
                      "myComputer":  "המחשב שלי",
                      "controlPanel":  "לוח בקרה",
                      "connectTo":  "התחבר אל",
                      "helpAndSupport":  "עזרה ותמיכה",
                      "search":  "חיפוש",
                      "run":  "הרץ"
                  },
    "windows":  {
                    "title":  "חלונות",
                    "myProjects":  "הפרויקטים שלי",
                    "myCV":  "קורות החיים שלי",
                    "cv":  {
                               "education":  "השכלה",
                               "proExperience":  "ניסיון מקצועי",
                               "projects":  "פרויקטים",
                               "technicalSkills":  "כישורים טכניים",
                               "languages":  "שפות תכנות",
                               "frameworks":  "כלים וטכנולוגיות"
                           },
                    "contact":  {
                                    "title":  "צור קשר",
                                    "name":  "@:common.name",
                                    "description":  "אם אתה רוצה לדבר על פרויקט, או סתם לשוחח, השאר לי הודעה ואני אחזור אליך בהקדם האפשרי!",
                                    "email":  "דוא״ל",
                                    "msgPlaceholder":  "הודעה כאן...",
                                    "to":  "אל :",
                                    "from":  "מאת :",
                                    "subject":  "נושא :",
                                    "message":  "הודעה",
                                    "send":  "שלח",
                                    "cut":  "גזור",
                                    "copy":  "העתק",
                                    "paste":  "הדבק",
                                    "undo":  "בטל",
                                    "check":  "בדוק",
                                    "spelling":  "איות",
                                    "attach":  "צרף",
                                    "priority":  "עדיפות",
                                    "sign":  "חתום",
                                    "success":  "ההודעה נשלחה בהצלחה",
                                    "error":  {
                                                  "email":  " אינה כתובת דוא״ל חוקית",
                                                  "empty":  "אנא מלא את כל השדות לפני שליחת ההודעה",
                                                  "subject":  "אנא הזן נושא לפני שליחת ההודעה",
                                                  "name":  "אנא הזן שם לפני שליחת ההודעה"
                                              }
                                },
                    "music":  {
                                  "playlistName":  "פורטפוליו - פלייליסט",
                                  "title":  "כותרת",
                                  "album":  "אלבום",
                                  "addedThe":  "נוסף ב",
                                  "duration":  "משך",
                                  "link":  "קישורים",
                                  "artist":  "אמן",
                                  "description":  "פלייליסט שנוצר במיוחד עבור הפורטפוליו שלי, הוא מכיל את השירים האהובים עלי.",
                                  "visitOnSpotify":  "האזן בספוטיפיי",
                                  "accessFirstSentence":  "כדי לגשת לתכונה זו,",
                                  "accessSecondSentence":  "חובה להתחבר ל-Spotify",
                                  "connectToSpotify":  "התחבר ל-Spotify",
                                  "spotifyDisclaimer":  "פלייליסט זה והשימוש בו נעשו באמצעות ה-API של Spotify",
                                  "albumCover":  "עטיפת אלבום",
                                  "playlistCoverAlt":  "עטיפת הפלייליסט"
                              },
                    "documents":  {
                                      "about":  {
                                                    "title":  "אודות",
                                                    "contextFirstParagraph":  "הפרויקט הזה נולד מהרצון ליצור תיק עבודות שהוא גם מהנה וגם מקורי.",
                                                    "contextSecondParagraph":  "הרעיון היה ליצור את ממשק המחשב של Windows XP, שיאפשר למבקרים לנווט בתיקיות ובקבצים בהפעלת המחשב שלי.",
                                                    "contextThirdParagraph":  "רציתי להציג את הפרויקטים שלי מזווית אחרת, שבה משתמשים יכולים לשוטט. משהו יותר מסתם כרטיס ביקור באינטרנט. משהו אינטראקטיבי.",
                                                    "contextFourthParagraph":  "הפרויקט תוכנן להיות קרוב ככל האפשר לממשק מחשב אמיתי של Windows XP, עם שולחן עבודה, תיקיות וקבצים.",
                                                    "contextFifthParagraph":  "Windows XP היא מערכת ההפעלה הראשונה שבה השתמשתי, והעיצוב שלה הוא נוסטלגיה עבורי. רציתי לחלוק לה כבוד.",
                                                    "contextSixthParagraph":  "הפרויקט הזה נוצר עם Vue.js, Vuex, Vue Router ו-SCSS. לקח לי בערך שנה להשלים (לסירוגין).",
                                                    "contextSeventhParagraph":  "הפרויקט הזה נעשה עם הרבה תשוקה וסבלנות, ואני מקווה שתהנה לדפדף במחשב שלי!",
                                                    "secondTitle":  "תודות",
                                                    "helpFirst":  "הפרויקט הזה בוצע בעזרת Dockurr Windows XP, שאיפשר לי להריץ סביבת Windows XP על המחשב שלי בקלות רבה.",
                                                    "helpSecond":  "ה-API של Spotify אפשר לי לאחזר את מידע הפלייליסט שלי, להציג אותו באתר שלי ולהוסיף נגן משולב.",
                                                    "helpThird":  "לצד השרת, השתמשתי בשרת Node.js כדי לקמפל את האתר ולנהל את טופס יצירת הקשר. האתר מתארח ב-Hostinger וה-CI/CD נעשה באמצעות השרת הביתי שלי.",
                                                    "helpFourth":  "הצלחתי לשחזר את תמונות Windows XP ולשלב אותן בפרויקט שלי הודות לאתר ארכיון האינטרנט. תודה רבה להם.",
                                                    "helpFifth":  "החתול שלי עזר בחלקו על ידי דריכה על המקלדת שלי, אבל בעיקר היא הייתה תמיכה מוסרית."
                                                },
                                      "legal":  {
                                                    "title":  "הודעה משפטית",
                                                    "firstParagraph":  "בהתאם להוראות החוק, משתמשי אתר התיק של יוני סבג מתוודעים לזהות הצדדים השונים המעורבים ביצירתו ובניטורו.",
                                                    "edit":  "עריכת האתר",
                                                    "secondParagraph":  "אתר זה נערך על ידי:",
                                                    "thirdParagraph":  "יוני סבג",
                                                    "hosting":  "אירוח",
                                                    "fourthParagraph":  "האתר מתארח על ידי GitHub Pages.",
                                                    "dirPublication":  "מנהל פרסום",
                                                    "fifthParagraph":  "מנהל הפרסום הוא: יוני סבג.",
                                                    "contact":  "צור קשר",
                                                    "sixthParagraph":  "לכל שאלה, מידע על המוצרים המוצגים באתר, או לגבי האתר עצמו, תוכל להשאיר הודעה בכתובת הדוא\"ל הבאה:"
                                                }
                                  }
                },
    "project":  {
                    "footballClips":  {
                                          "funMessage":  "תהנו מהתחביב השני שלי! ⚽🏃‍♂️"
                                      },
                    "discreteMath":  {
                                         "contextFirstParagraph":  "חדר הבריחה למתמטיקה בדידה הוא משחק חידות חינוכי בתצוגה דו-ממדית מלמעלה שנבנה ב-Godot 4.5, המלמד מושגי מתמטיקה בדידה דרך מיני-משחקים אינטראקטיביים. שחקנים מנווטים דרך חדרים מחוברים ופותרים חידות קריפטוגרפיה, לוגיקה ותורת הקבוצות.",
                                         "contextSecondParagraph":  "המשחק כולל מערכת בריאות שבה ניסיונות שגויים לפתרון חידות גורמים לאובדן לבבות, יוצרים השלכות משמעותיות ללמידה. שחקנים חוקרים סביבת פיקסל ארט, מקיימים אינטראקציה עם אובייקטים כדי למצוא רמזים ולפתוח שלוש חידות מתמטיות שונות שכולן חייבות להיפתר כדי לברוח.",
                                         "contextThirdParagraph":  "פותח כפרויקט גמר מספטמבר 2025 עד דצמבר 2025, משחק זה מדגים מיומנויות מתקדמות במנוע Godot כולל singleton autoloads, ניהול סצינות ומערכות מצב קבועות תוך יצירת חוויה חינוכית מרתקת.",
                                         "goalFirst":  "ללמד מתמטיקה בדידה דרך מכניקות משחק אינטראקטיביות",
                                         "goalSecond":  "ליישם שלושה מיני-משחקים מדויקים מתמטית: פענוח צופן Affine, השלמת טבלאות אמת וחיתוכי תורת הקבוצות",
                                         "goalThird":  "ליצור מערכת עונש בריאות שמעודדת למידה מטעויות",
                                         "goalFourth":  "לעצב מערכת אינטראקציה אינטואיטיבית עם משוב ויזואלי",
                                         "goalFifth":  "לבנות לולאת משחק שלמה עם מעקב התקדמות ותנאי ניצחון",
                                         "goalSixth":  "לפתח ממשק משתמש מלוטש בסגנון רטרו עם תפריטים, דיאלוגים ו-HUD",
                                         "tasksDoneFirst":  "ארכיטקטורת מיני-משחקים מודולרית",
                                         "tasksDoneFirstDetails":  "פיתוח מחלקת BaseMiniGame עם שלוש חידות חינוכיות: מפענח צופן Affine המיישם D(x) = a⁻¹(x - b) mod 26 עם 15 הודעות מוצפנות ייחודיות, חידת טבלת אמת המכסה אופרטורים לוגיים (NOT, AND, OR, השלכה, שקילות) עם 5 וריאציות שאלות, ומשחק רשת תורת הקבוצות המחייב שחקנים למצוא אלמנטי חיתוך באמצעות מערכות קואורדינטות. כל מיני-משחק כולל מצב קבוע, ניסיונות מוגבלים (3 לכל חידה), callbacks להצלחה/כישלון והקפאת שחקן אוטומטית במהלך המשחק.",
                                         "tasksDoneSecond":  "מערכות משחק מבוססות Singleton",
                                         "tasksDoneSecondDetails":  "בניית חמישה singletons autoload לניהול מצב המשחק: MiniGameManager למחזור חיים של חידות ומעקב השלמה, DialogBox לתצוגת טקסט דינמית עם תמיכת BBCode וגודל אוטומטי, HealthManager למערכת HP מבוססת לבבות (3 לבבות = 6 HP), InteractionManager לאינטראקציות אובייקטים מבוססות קרבה עם חישובי מרחק ממוינים, ו-NavigationManager למעברי חדרים עם מיקום spawn. כל המערכות מתקשרות באמצעות אותות לצימוד רופף.",
                                         "tasksDoneThird":  "יישום UI/UX מלא",
                                         "tasksDoneThirdDetails":  "עיצוב ויישום ממשק מקיף באמצעות גופן הפיקסל Press Start 2P לאורך כולו: תפריט ראשי עם אפשרויות משחק/יציאה, תפריט השהיה נגיש דרך ESC עם פונקציונליות המשך/יציאה, HUD שחקן דינמי המציג לבבות המתעדכנים בזמן אמת, תיבות דיאלוג בגודל אוטומטי על בסיס תוכן הטקסט, ממשקי מיני-משחקים עם תוויות משוב ומוני ניסיונות, ומסך ניצחון המעקב אחר השלמת כל החידות ומאפשר הפעלה מחדש או ניווט לתפריט הראשי.",
                                         "tasksDoneFourth":  "מערכת התקדמות מבוססת חדרים",
                                         "tasksDoneFourthDetails":  "יצירת מספר חדרים מחוברים (לובי, חדר 1, חדר 2, חדר 3) באמצעות מערכת ניווט מבוססת דלתות. כל חדר מכיל InteractableObjects שמפעילים דיאלוגי טקסט או מיני-משחקים. יישום דלת סופית שבודקת את מצב ההשלמה של כל שלוש החידות (צופן, טבלאות אמת, תורת הקבוצות) ומציגה התקדמות מקודדת בצבעים (ירוק=הושלם, אדום=בתהליך, אפור=לא התחיל) לפני שמאפשרת בריחה. המשחק מנוצח רק כאשר כל החידות נפתרות בהצלחה."
                                     },
                    "mazeEscape":  {
                                       "contextFirstParagraph":  "Maze Escape הוא משחק יריות אקשן דו-ממדי בתצוגה מלמעלה שפותח ב-Unity כפרויקט סיום לקורס עיצוב ופיתוח משחקים (GAM145) בסתיו 2024.",
                                       "contextSecondParagraph":  "המשחק מאתגר שחקנים לנווט דרך מפה בסגנון זירה בודדת תוך כדי לחימה בגלי אויבים עם התנהגויות AI ייחודיות, איסוף שדרוגים, והישרדות מול אויב בוס שמזמן איומים נוספים.",
                                       "contextThirdParagraph":  "פרויקט זה מדגים כישורי פיתוח Unity בסיסיים כולל יישום AI של אויבים, מערכות בריאות, מכניקות שדרוגים, בקרות ירי עם כיוון עכבר ויכולות תנועת דאש.",
                                       "goalFirst":  "יצירת בקרות רספונסיביות דו-ממדיות מלמעלה עם ירי בכיוון עכבר",
                                       "goalSecond":  "יישום שלושה סוגי AI ייחודיים של אויבים עם התנהגויות שונות",
                                       "goalThird":  "עיצוב מערכת איסוף שדרוגים לבריאות ושיפורי מהירות",
                                       "goalFourth":  "פיתוח מעקב בריאות ממשק למשתמש עבור שחקן ומפגשי בוס",
                                       "goalFifth":  "בניית אויב בוס עם ירי רב-כיווני והזמנת אויבים",
                                       "goalSixth":  "הוספת יכולת דאש לתנועת שחקן טקטית",
                                       "tasksDoneFirst":  "בקר שחקן ומכניקות ירי",
                                       "tasksDoneFirstDetails":  "יישום בקרות תנועה WASD עם ירי בכיוון עכבר שבו השחקן מסתובב להתמודד עם הסמן. יצירת מערכת ירי כדורים מבוססת דחף ששולחת קליעים לכיוון העכבר בלחיצה. הוספת יכולת דאש באמצעות מקש הרווח לתנועת התחמקות מהירה עם מערכת זמן קירור.",
                                       "tasksDoneSecond":  "AI של אויבים עם התנהגויות מגוונות",
                                       "tasksDoneSecondDetails":  "פיתוח שלושה סוגי אויבים שונים: אויבי מרדף שרודפים אחרי השחקן בתוך רדיוס זיהוי וגורמים נזק דחיפה במגע; אויבי טווח רחוק ששומרים על מרחק תוך כדי ירי קליעים על השחקן; ואויבי שריפה שמפעילים אפקטי נזק-לאורך-זמן דרך קורוטינות כאשר מתנגשים עם השחקן.",
                                       "tasksDoneThird":  "מערכת איסוף שדרוגים",
                                       "tasksDoneThirdDetails":  "יצירת שדרוגים לאיסוף כולל פריטי שיקום בריאות, שיפורי מהירות שמגדילים לצמיתות את מהירות התנועה, ושדרוגי מפחית אויבים שפוגעים בכל האויבים על המסך בו-זמנית. יישום מערכת איסוף מבוססת טריגר עם השמדה מיידית עם האיסוף.",
                                       "tasksDoneFourth":  "מכניקות מפגש בוס",
                                       "tasksDoneFourthDetails":  "בניית אויב בוס נייח שמופעל כאשר השחקן נכנס לרדיוס הזיהוי שלו. הבוס יורה כדורים ממספר נקודות אש בו-זמנית בכיוונים קבועים ומזמן את כל שלושת סוגי האויבים סביבו במרווחים. יישום מערכת ממשק בריאות בוס ייעודית נפרדת מבריאות אויבים רגילה."
                                   },
                    "nourishNet":  {
                                       "contextFirstParagraph":  "NourishNet היא אפליקציית מובייל חוצת פלטפורמות שפותחה עם React Native ו-Expo שעוזרת למשתמשים לאתר ולגשת למשאבי סיוע מזון באזורם. האפליקציה מספקת מידע מפורט על מזווני מזון, מטבחי תמחוי ומרכזי הפצה קהילתיים כולל שעות פעילות, דרישות זכאות והתאמות תזונתיות.",
                                       "contextSecondParagraph":  "האפליקציה כוללת מיקום בזמן אמת עם תצוגות מפה ורשימה אינטראקטיביות, המאפשרות למשתמשים לגלות משאבי מזון קרובים עם חישובי מרחק. משתמשים יכולים לסנן משאבים לפי זמינות (פתוח כעת), צרכים תזונתיים (צמחוני, ללא גלוטן, הלאל, כשר), סוג ארגון, אמצעי תחבורה ודרישות מידע אישי.",
                                       "contextThirdParagraph":  "פותח כפרויקט גמר לפיתוח מובייל מנובמבר 2025 עד דצמבר 2025, אפליקציה זו מדגימה יישום מעשי של Firebase Firestore, אינטגרציית Google Maps, AsyncStorage לשמירת נתונים מקומית, ו-UI/UX מובייל מלוטש עם אנימציות מותאמות אישית וטיפול בתנועות.",
                                       "goalFirst":  "בניית פתרון מובייל נגיש לאיתור משאבי סיוע מזון",
                                       "goalSecond":  "יישום גילוי משאבים מבוסס מיקום עם תצוגות מפה ורשימה",
                                       "goalThird":  "יצירת מערכת סינון מקיפה להתאמת משאבים אישית",
                                       "goalFourth":  "אינטגרציית Firebase Firestore לניהול נתונים בזמן אמת",
                                       "goalFifth":  "הפעלת מועדפים עם יכולת לא מקוונת באמצעות AsyncStorage",
                                       "goalSixth":  "עיצוב מעברי ממשק חלקים ואינטראקציות מבוססות תנועות",
                                       "tasksDoneFirst":  "ארכיטקטורת אפליקציית מובייל React Native",
                                       "tasksDoneFirstDetails":  "בניית אפליקציית מובייל חוצת פלטפורמות באמצעות React Native 0.81.5 ו-Expo SDK 54, המאפשרת פריסת iOS ו-Android מבסיס קוד אחד. יישום ניווט מבוסס סטאק עם React Navigation, כולל הצגות מודאליות ומעברי שקופיות מותאמים אישית. יצירת רכיבים ניתנים לשימוש חוזר והקמת תבנית ניהול מצב מרכזית באמצעות יישום חנות מותאמת אישית עם עדכונים מבוססי מנוי.",
                                       "tasksDoneSecond":  "שירותי מיקום ומיפוי",
                                       "tasksDoneSecondDetails":  "אינטגרציה של Expo Location API עם זרימת טיפול בהרשאות וגיבוי למיקום ברירת מחדל (ניו יורק). יישום react-native-maps עם סמנים מותאמים המציגים מיקומי משאבים עם אפקטי נפילה מונפשים. יצירת פונקציונליות חישוב מרחק באמצעות נוסחת Haversine לחישוב קרבה במיילים. בניית מערכת תצוגה כפולה המאפשרת למשתמשים לעבור בין מפה אינטראקטיבית עם סמנים מקובצים לתצוגת רשימה ניתנת למיון עם אינדיקטורי מרחק.",
                                       "tasksDoneThird":  "סינון וחיפוש מתקדמים",
                                       "tasksDoneThirdDetails":  "פיתוח מערכת סינון מקיפה עם הצגה מודאלית התומכת במספר קריטריונים: זמינות (פתוח כעת על בסיס ניתוח יום/שעה נוכחיים), צרכים תזונתיים (בחירה מרובה), סוג ארגון (ממשלה, כנסייה, מרכז קהילתי, עמותה), אמצעי תחבורה (הליכה/תחבורה ציבורית/נסיעה עם סינון מבוסס מרחק), ודרישות מידע אישי. יישום אופטימיזציית שאילתות Firestore עם סינון בצד לקוח לחיפושים מורכבים מרובי קריטריונים.",
                                       "tasksDoneFourth":  "שמירת נתונים ומועדפים",
                                       "tasksDoneFourthDetails":  "יישום AsyncStorage לניהול מועדפים עם יכולת לא מקוונת, שומר העדפות משתמש מקומית. יצירת אינטראקציית תנועת החלקה למחיקה להסרת מועדפים באמצעות react-native-gesture-handler. בניית תצוגת משאב מפורטת עם הצגת מידע מקיפה כולל שעות פעילות מנותחות, קריטריוני זכאות, כללים, מידע תחבורה ופרטים נוספים. אינטגרציה של קישור עמוק ל-Apple Maps עם ניווט מבוסס קואורדינטות או כתובת.",
                                       "tasksDoneFifth":  "UI/UX ואנימציות",
                                       "tasksDoneFifthDetails":  "עיצוב ממשק משתמש מלוטש עם אנימציות מותאמות אישית כולל רצפי דהייה של מסך ברוכים הבאים, אנימציות נפילת סמני מפה, מעברי טאבים חלקים באמצעות פיזיקת קפיץ, ומשוב סקאלה של כפתור מועדפים. יישום פונקציונליות משיכה לרענון, בקרות מפולחות להחלפת תצוגה ופריסות רספונסיביות מותאמות לגדלי מסך שונים. יצירת זרימת בקשת הרשאה מותאמת אישית עם הצגה מודאלית מונפשת לגישת מיקום."
                                   },
                    "gameAssetAiAgent":  {
                                             "contextFirstParagraph":  "Game Asset AI Agent היא אפליקציית אינטרנט מבוססת בינה מלאכותית שיחתית העוזרת למפתחי משחקים לייצר נכסי משחק דו-ממדיים באמצעות אינטראקציות צ'אט בשפה טבעית.",
                                             "contextSecondParagraph":  "האפליקציה כוללת ממשק צ'אט דמוי-Discord שנבנה עם React, מופעל על ידי backend Python Flask המשלב את Gemini 2.5 Flash Lite של Google לשיחה חכמה ושיפור פרומפטים מודעי הקשר עם API של text-to-image של Clipdrop ליצירת נכסים בפועל. הבינה המלאכותית שומרת היסטוריית שיחות כדי להבין את כוונת המשתמש ודרישות הפרויקט על פני אינטראקציות מרובות.",
                                             "contextThirdParagraph":  "הפרויקט מדגים שילוב תהליכי עבודה מונעי בינה מלאכותית דרך ממשק שיחתי שבו משתמשים יכולים לתאר באופן טבעי את הצרכים שלהם, לקבל פרומפטים משופרים על ידי בינה מלאכותית לאישור, וליצור נכסים ויזואליים מוכנים למשחק עם מעקב אשראי מובנה, תצוגה מקדימה של תמונות ויכולות הורדה.",
                                             "goalFirst":  "יצירת עוזר בינה מלאכותית שיחתי ליצירת נכסי משחק",
                                             "goalSecond":  "בניית ממשק צ'אט אינטואיטיבי בסגנון Discord עם React",
                                             "goalThird":  "אינטגרציית Gemini AI להבנת שפה טבעית וזיהוי כוונות",
                                             "goalFourth":  "יישום שיחה מודעת הקשר עם זיכרון על פני הפעלות צ'אט",
                                             "goalFifth":  "אספקת תהליך עבודה חלק ליצירת תמונות עם תצוגה מקדימה ותכונות הורדה",
                                             "goalSixth":  "הפעלת שיפור פרומפטים חכם לאיכות יצירת נכסים טובה יותר",
                                             "tasksDoneFirst":  "פיתוח ממשק צ'אט React",
                                             "tasksDoneFirstDetails":  "בניית ממשק משתמש צ'אט בהשראת Discord באמצעות React ו-Vite עם הודעות בזמן אמת, היסטוריית שיחות וגלילה אוטומטית. יישום זיהוי גלילת משתמש עם כפתור 'גלול למטה' לחוויית משתמש טובה יותר. יצירת רכיבי הודעות עם תמיכה ב-markdown, חותמות זמן ועיצוב אווטר עבור הודעות משתמש ובינה מלאכותית כאחד.",
                                             "tasksDoneSecond":  "בינה מלאכותית שיחתית עם מודעות הקשר",
                                             "tasksDoneSecondDetails":  "אינטגרציה של Gemini 2.5 Flash Lite של Google לאפשר שיחות טבעיות עם זיהוי כוונות, הבחנה בין צ'אט רגיל לבקשות יצירת נכסים. יישום מעקב היסטוריית שיחות (10 הודעות אחרונות) לשמירת הקשר על פני אינטראקציות, מאפשר לבינה המלאכותית לזכור נושאי משחק, סגנונות והעדפות שנדונו בעבר מבלי לדרוש מהמשתמשים לחזור על המידע.",
                                             "tasksDoneThird":  "זיהוי כוונות ותהליך עבודה של אישור",
                                             "tasksDoneThirdDetails":  "פיתוח צינור יצירה רב-שלבי באמצעות Gemini AI לפרש כוונת משתמש בהקשרים שונים (תגובות אישור, בקשות תמונה חדשות, צ'אט כללי). המערכת מנתחת תגובות משתמש כדי לקבוע אם הן מאשרות, דוחות או זקוקות להבהרה, יוצרת זרימה שיחתית טבעית עם וריאציות תגובה אקראיות לחוויה דמוית אנושית יותר.",
                                             "tasksDoneFourth":  "יצירת תמונות וניהול נכסים",
                                             "tasksDoneFourthDetails":  "אינטגרציית API של Clipdrop ליצירת text-to-image עם פרומפטים משופרים מ-Gemini. יישום חלון תצוגה מקדימה של תמונה במסך מלא, פונקציונליות הורדה ישירה ומערכת מעקב אשראי שעוקבת אחר שיחות API חינמיות נותרות (100 בחינם). יצירת אינדיקטורים ויזואליים לאשראי עם אזהרות מקודדות צבע כאשר האשראי נמוך, וכולל התראות אוטומטיות בסף מפתח (5 ו-1 נותרים)."
                                         },
                    "portfolioXP":  {
                                        "contextFirstParagraph":  "PortfolioXP הוא אתר תיק עבודות אינטראקטיבי המעוצב כשחזור נאמן לממשק מערכת ההפעלה האיקונית Windows XP, המביא חוויות מחשוב נוסטלגיות לאינטרנט המודרני.",
                                        "contextSecondParagraph":  "נבנה עם Vue.js 3, Vite, Tailwind CSS ו-SCSS, פרויקט זה מדגים מיומנויות פיתוח frontend מתקדמות דרך שכפול ממשק משתמש מדויק לפיקסל, אנימציות מותאמות אישית, ניהול מצב עם Pinia stores, ותמיכה בבינלאומיות לאנגלית ועברית.",
                                        "contextThirdParagraph":  "תיק העבודות הופך את פורמט קורות החיים המסורתי לחוויה מרתקת וחקרנית בה המבקרים יכולים לנווט דרך אייקונים של שולחן עבודה, לפתוח חלונות, לעיין בפרויקטים, לשחק משחקים כמו מוקשים ו-DOOM, להאזין למוזיקה, לצפות בקורות חיים, לשלוח אימיילים ולקיים אינטראקציה עם סביבה פונקציונלית לחלוטין בנושא Windows XP המציגה פרויקטי פיתוח בצורה חדשנית ובלתי נשכחת.",
                                        "goalFirst":  "שחזור ממשק Windows XP עם דיוק מדויק לפיקסל ואינטראקציות אותנטיות",
                                        "goalSecond":  "בניית ארכיטקטורת רכיבים מודולרית לאלמנטי ממשק משתמש וחלונות לשימוש חוזר",
                                        "goalThird":  "יישום ניהול מצב למיקום חלונות, אפליקציות פתוחות והעדפות משתמש",
                                        "goalFourth":  "יצירת חוויה בינלאומית התומכת במספר שפות (אנגלית, עברית)",
                                        "goalFifth":  "שילוב תכונות אינטראקטיביות כולל נגן מוזיקה, גלריית תמונות, לוח שנה וטופס יצירת קשר",
                                        "goalSixth":  "אופטימיזציה של ביצועים ונגישות תוך שמירה על האסתטיקה הרטרו",
                                        "tasksDoneFirst":  "ארכיטקטורת Vue.js 3 ומערכת רכיבים",
                                        "tasksDoneFirstDetails":  "פיתוח ארכיטקטורה מקיפה מבוססת רכיבים באמצעות API של Composition של Vue.js 3 עם למעלה מ-50 רכיבים מותאמים אישית כולל חלונות, כפתורים, תפריטים, מודלים ואלמנטים אינטראקטיביים. יישום Vue Router לניווט בין תצוגות Loader ו-Office, ניהול זרימת הכניסה וחוויית שולחן העבודה. יצירת רכיבי פריסה לשימוש חוזר כמו Window.vue, ContentCenter.vue ו-DesktopAppsLayout.vue המספקים מבנה עקבי בכל חלונות האפליקציה. שימוש ב-Pinia stores (windowsStore, localeStore, connectionStore, volumeStore, desktopIconsStore, goBackStore) לניהול מצב מרכזי עם התמדה ב-localStorage.",
                                        "tasksDoneSecond":  "יישום אותנטי של ממשק משתמש/חוויית משתמש של Windows XP",
                                        "tasksDoneSecondDetails":  "שחזור קפדני של מערכת העיצוב החזותית של Windows XP כולל טפט Bliss האיקוני, צבעי ערכת נושא Luna, רקעים מדורגים, chrome חלונות עם כפתורים למזער/להגדיל/לסגור, תפריט התחל עם מעברים מונפשים, שורת משימות עם מגש מערכת וסמני עכבר אותנטיים. יישום שיפועי CSS מדויקים לפיקסל התואמים את ממשק המשתמש המקורי של Windows XP, גופנים מותאמים אישית (MS Sans Serif, Tahoma, Trebuchet MS), ופריסות רספונסיביות המתאימות את ממשק XP לגדלי מסך מודרניים. הוספת אנימציות עדינות ואפקטי ריחוף המשקפים את האינטראקציות המקוריות של מערכת ההפעלה, יוצרים חוויה נוסטלגית מרתקת.",
                                        "tasksDoneThird":  "בינלאומיות וניהול תוכן",
                                        "tasksDoneThirdDetails":  "שילוב Vue I18n לבינלאומיות מקיפה התומכת באנגלית ועברית (RTL) עם למעלה מ-250 מפתחות תרגום בכל אלמנטי ממשק המשתמש, תיאורי הפרויקטים והודעות המערכת. יצירת מערכת ניהול נתונים מובנית באמצעות קבצי JSON (projects-data.json, cv-data.json, playlist-data.json, pictures-data.json, terminal-data.json, windows-data.json, header-menu-data.json) לעדכוני תוכן קלים ללא שינויי קוד. יישום טעינת רכיבים דינמית המבוססת על בחירת פרויקט, המאפשרת לכל פרויקט להיות בעל רכיב תוכן מפורט משלו עם פריסות ומדיה מותאמות אישית.",
                                        "tasksDoneFourth":  "צינור DevOps ופריסה",
                                        "tasksDoneFourthDetails":  "הקמת צינור CI/CD מלא באמצעות Jenkins לבניות ופריסות אוטומטיות, שילוב SonarQube לניתוח איכות קוד ושמירה על תקני קוד נקיים, ויצירת קונטיינריזציה של Docker עם שרת אינטרנט nginx לפריסות ייצור עקביות. הגדרת זרימת עבודה של פריסה ב-GitHub Pages לאירוח אתר תיק העבודות עם הגדרה נכונה של נתיב בסיס. יישום אופטימיזציית build עם bundler Vite לזמני טעינה מהירים, חלוקת קוד ומסירת assets יעילה. הוספת בדיקות E2E מקיפות באמצעות Nightwatch.js כדי להבטיח פונקציונליות בדפדפנים שונים ולשמור על הבטחת איכות לאורך איטרציות הפיתוח."
                                    }
                },
    "buttons":  {
                    "close":  "סגור",
                    "minimize":  "מזער",
                    "maximize":  "הגדל",
                    "restore":  "שחזר",
                    "downloadCV":  "הורד קורות חיים",
                    "linkRepository":  "קישור למאגר",
                    "visitWebsite":  "בקר באתר",
                    "linkWebSite":  "בקר באתר",
                    "seeMore":  "ראה עוד"
                },
    "footer":  {
                   "fullscreen":  "מסך מלא",
                   "exitFullscreen":  "יציאה ממסך מלא",
                   "volumeControl":  "שליטת עוצמה"
               },
    "alt":  {
                "logoStart":  "לוגו תיק XP שחור התחלה",
                "logoLoading":  "לוגו תיק XP שחור טעינה",
                "logoLogin":  "לוגו תיק XP לבן כניסה",
                "currLang":  "שפה נוכחית",
                "cvPhoto":  "תמונת קורות חיים",
                "albumCover":  "עטיפת אלבום",
                "previousMusic":  "שיר קודם",
                "nextMusic":  "שיר הבא",
                "dropdown":  "תפריט נפתח",
                "expand":  "הרחבה",
                "project":  "פרויקט",
                "projectIcon":  "איקון פרויקט"
            }
}
